create table point
(
	id INTEGER not null
		constraint point_pk
			primary key autoincrement,
	name varchar not null
);

create unique index point_id_uindex;


create table user
(
	id INTEGER not null
		constraint user_pk
			primary key autoincrement,
	last_name varchar not null,
	first_name varchar not null,
	role int not null
);

create unique index user_id_uindex
	on user (id);



create table schedule
(
	id INTEGER not null
		constraint schedule_pk
			primary key autoincrement,
	point_start int not null
		constraint point_start__fk
			references point,
	point_end int not null
		constraint point_end__fk
			references point,
	machinist int not null
		constraint machinist__fk
			references user,
	time_start time not null,
	time_finish time not null,
	weekday int not null
);

create unique index schedule_id_uindex
	on schedule (id);



create table messages
(
	id INTEGER not null
		constraint messages_pk
			primary key autoincrement,
	text VARCHAR not null,
	date datetime,
	place int
		constraint messages_point_id_fk
			references point,
	sender int
		constraint sender__fk
			references user
);

create unique index messages_id_uindex
	on messages (id);










INSERT INTO point (name) VALUES
('Царицыно'),
('Орехово'),
('Домодедовская'),
('Красногвардейская'),
('Алма-Атинская'),
('Пятницкое шоссе'),
('Митино'),
('Волоколамская'),
('Мякинино'),
('Строгино'),
('Крылатское'),
('Молодёжная'),
('Кунцевская'),
('Славянский бульвар'),
('Парк Победы'),
('Киевская'),
('Смоленская'),
('Арбатская'),
('Площадь Революции'),
('Курская'),
('Бауманская'),
('Электрозаводская'),
('Семёновская'),
('Партизанская'),
('Измайловская'),
('Первомайская'),
('Щёлковская'),
('Кунцевская'),
('Бульвар Рокоссовского'),
('Черкизовская'),
('Преображенская площадь'),
('Сокольники'),
('Красносельская'),
('Комсомольская'),
('Красные Ворота'),
('Чистые пруды'),
('Лубянка'),
('Охотный Ряд'),
('Библиотека имени Ленина'),
('Кропоткинская'),
('Парк культуры'),
('Фрунзенская'),
('Спортивная'),
('Воробьёвы горы'),
('Университет'),
('Проспект Вернадского'),
('Юго-Западная'),
('Тропарёво'),
('Румянцево'),
('Саларьево'),
('Ховрино'),
('Беломорская'),
('Речной вокзал'),
('Водный стадион'),
('Войковская'),
('Сокол'),
('Аэропорт'),
('Динамо'),
('Белорусская'),
('Маяковская'),
('Тверская'),
('Театральная'),
('Новокузнецкая'),
('Павелецкая'),
('Автозаводская'),
('Технопарк'),
('Коломенская'),
('Каширская'),
('Кантемировская'),
('Пионерская'),
('Филёвский парк'),
('Багратионовская'),
('Фили'),
('Кутузовская'),
('Студенческая'),
('Международная'),
('Выставочная'),
('Киевская'),
('Смоленская'),
('Арбатская'),
('Александровский сад'),
('Парк культуры'),
('Октябрьская'),
('Добрынинская'),
('Павелецкая'),
('Таганская'),
('Курская'),
('Комсомольская'),
('Проспект Мира'),
('Новослободская'),
('Белорусская'),
('Краснопресненская'),
('Киевская'),
('Медведково'),
('Бабушкинская'),
('Свиблово'),
('Ботанический сад'),
('ВДНХ'),
('Алексеевская'),
('Рижская'),
('Проспект Мира'),
('Сухаревская'),
('Тургеневская'),
('Китай-город'),
('Третьяковская'),
('Октябрьская'),
('Ленинский проспект'),
('Академическая'),
('Профсоюзная'),
('Новые Черёмушки'),
('Калужская'),
('Беляево'),
('Коньково'),
('Тёплый Стан'),
('Ясенево'),
('Новоясеневская'),
('Планерная'),
('Сходненская'),
('Тушинская'),
('Спартак'),
('Щукинская'),
('Октябрьское Поле'),
('Беговая'),
('Улица 1905 года'),
('Баррикадная'),
('Пушкинская'),
('Кузнецкий Мост'),
('Китай-город'),
('Таганская'),
('Пролетарская'),
('Волгоградский проспект'),
('Текстильщики'),
('Кузьминки'),
('Рязанский проспект'),
('Выхино'),
('Лермонтовский проспект'),
('Жулебино'),
('Котельники'),
('Рассказовка'),
('Новопеределкино'),
('Боровское шоссе'),
('Солнцево'),
('Говорово'),
('Озёрная'),
('Мичуринский проспект'),
('Раменки'),
('Ломоносовский проспект'),
('Минская'),
('Парк Победы'),
('Деловой центр'),
('Третьяковская'),
('Марксистская'),
('Площадь Ильича'),
('Авиамоторная'),
('Шоссе Энтузиастов'),
('Перово'),
('Новогиреево'),
('Новокосино'),
('Алтуфьево'),
('Бибирево'),
('Отрадное'),
('Владыкино'),
('Петровско-Разумовская'),
('Тимирязевская'),
('Дмитровская'),
('Савёловская'),
('Менделеевская'),
('Цветной бульвар'),
('Чеховская'),
('Боровицкая'),
('Полянка'),
('Серпуховская'),
('Тульская'),
('Нагатинская'),
('Нагорная'),
('Нахимовский проспект'),
('Севастопольская'),
('Чертановская'),
('Южная'),
('Пражская'),
('Улица Академика Янгеля'),
('Аннино'),
('Бульвар Дмитрия Донского'),
('Селигерская'),
('Верхние Лихоборы'),
('Окружная'),
('Петровско-Разумовская'),
('Бутырская'),
('Марьина Роща'),
('Достоевская'),
('Трубная'),
('Сретенский бульвар'),
('Чкаловская'),
('Римская'),
('Крестьянская застава'),
('Дубровка'),
('Кожуховская'),
('Печатники'),
('Волжская'),
('Люблино'),
('Братиславская'),
('Марьино'),
('Борисово'),
('Шипиловская'),
('Зябликово'),
('Деловой центр'),
('Шелепиха'),
('Хорошёвская'),
('ЦСКА'),
('Петровский парк'),
('Савёловская'),
('Каширская'),
('Варшавская'),
('Каховская'),
('Битцевский парк'),
('Лесопарковая'),
('Улица Старокачаловская'),
('Улица Скобелевская'),
('Бульвар Адмирала Ушакова'),
('Улица Горчакова'),
('Бунинская аллея'),
('Павелецкая'),
('Новокузнецкая'),
('Электрозаводская'),
('Кунцевская'),
('Тверская'),
('Дубровка'),
('Сретенский бульвар'),
('Славянский бульвар'),
('Спартак'),
('Технопарк'),
('Беломорская'),
('Чистые пруды'),
('Александровский сад'),
('Арбатская'),
('Смоленская'),
('Киевская'),
('Воробьёвы горы'),
('Семёновская'),
('Электрозаводская'),
('Парк культуры'),
('Бауманская'),
('Фрунзенская'),
('Деловой центр')
